[{"title":"Coloring Your Git Branch Name","dateCreated":"2014-01-24","id":"color-git-branch-name-in-bash-prompt","tags":["Bash","Cygwin","Git"],"header":"#### Desired Effect\nIf you use git often then you might find helpful having current branch name right in the command prompt. Highlighting \"dirty\" branches is also a good thing.\n\n#### Entry Point\nI started tweaking my bash prompt by reading [this article](http://mediadoneright.com/content/ultimate-git-ps1-bash-prompt); a lot of interesting tricks were described there. Unfortunately there were too much for me, I needed a more simpler solution with less text on screen (and in configs). So I came up with the following script:","url":"/en/color-git-branch-name-in-bash-prompt.html"},{"title":"Creating Weather Forecast Widget Using Node.js And Redis","dateCreated":"2014-01-31","id":"weather-forecast-widget","tags":["Cairo","Express","Mustache","Node","Canvas","Redis","Weather Widget"],"header":"#### What we're going to build\nIn this post I'm going to describe a process of creating a simple weather forecast widget. I'm going to use Redis as a persistance mechanism, Node.js + Express with Mustache template engine as a foundation for web interface; and a module based on Cairo called \"node canvas\" for generating images serverside.","url":"/en/weather-forecast-widget.html"},{"title":"Making IE Browser Helper Objects Enabled By Default","dateCreated":"2014-04-22","id":"making-ie-bho-enabled-by-default","tags":["BHO","c++","Internet Explorer"],"header":"#### The problem\nSuppose you write a great BHO to enhance user experience on the Web. Due to security reasons every time user installs your BHO and launches Internet Explorer he/she is prompted to enable the piece of software. At first glance - not a big deal, one extra click won't bother anybody. However this IE behavior causes a serious problem. The <code>IObjectWithSite::SetSite</code> method isn't triggered even after one pushes \"enable\" button. <code>DWebBrowserEvents2</code> aren't fired too. Therefore there is no way to determine that user accepted the BHO and it's time to rock. [Here](http://social.msdn.microsoft.com/Forums/ie/en-US/c6f64c9e-5a34-4d6f-a20e-7bc4fc8c6bac/enable-event-for-bho-in-ie9?forum=ieextensiondevelopment) the question is explained in more details.","url":"/en/making-ie-bho-enabled-by-default.html"},{"title":"Selectively Gzipping Your Site","dateCreated":"2014-06-02","id":"selectively-gzipping-your-site","tags":["Express","Gzip","Node"],"header":"#### Motivation\nI decided to build my personal web site. The key idea was to keep things as simple and fast as possible while sticking with modern cool techniques like SPA and MVVM.","url":"/en/selectively-gzipping-your-site.html"},{"title":"Selenium Forbids Opening Links In A New Tab Instead Of A New Window In Firefox","dateCreated":"2014-07-18","id":"selenium-forbids-opening-links-in-new-tab","tags":["Selenium","Firefox","Tab"],"header":"#### Test opening new tab? Not so fast\nRecently I tested some stuff with Selenium WebDriver and noticed that Firefox always opens links with <code>target=\"_blank\"</code> in a new window. I found that I can change this behavior by altering FF profile like this:","url":"/en/selenium-forbids-opening-links-in-new-tab.html"},{"title":"Optimizing The Site","dateCreated":"2014-07-26","id":"optimizing-the-site","tags":["optimization","node","gruntjs","performance"],"header":"#### Why optimize?\nI've finished the first iteration of building my personal web site; it means it's time to think about web optimization. What if I can keep things as they are now? Let's examine [gtmetrix](http://gtmetrix.com/) results: ","url":"/en/optimizing-the-site.html"},{"title":"The Site Has Finally Gone Live!","dateCreated":"2014-07-28","id":"the-site-has-finally-gone-live","tags":[],"header":"#### At last\nI'm excited to announce my site's first release! Although it isn't feature rich I consider this event as a very important milestone in my development career.","url":"/en/the-site-has-finally-gone-live.html"},{"title":"Dates Localization In Angular","dateCreated":"2014-08-11","id":"dates-localization-in-angular","tags":["Angular","date","localization"],"header":"#### Why not using angular built in localization capabilities?\nLet's examine what angular platform [can offer](https://docs.angularjs.org/guide/i18n). They suggest specifying one language per page by referencing the corresponding version of localization script. One can speculate on this approach by adding some script referencing logic on a server, but do I really need to reload the entire page just to change language context?","url":"/en/dates-localization-in-angular.html"},{"title":"Google Analytics In Angular","dateCreated":"2014-08-12","id":"google-analytics-in-angular","tags":["Google Analytics","Angular"],"header":"#### A good start is important\nAdding google analytics to a site is straightforward. There are tons of documentation/articles/posts on the Internet about it. Here I'm going to show a possible way of adding google analytics to a single page app (based on Angular) and counting page views. The approach can be further extended to collect other metrics but I think counting page views is a good start.","url":"/en/google-analytics-in-angular.html"},{"title":"Second Iteration Completed","dateCreated":"2014-08-13","id":"second-iteration-completed","tags":[],"header":"#### New features\nI've just finished the second iteration of building my personal web site.\n- [dates localization](/en/dates-localization-in-angular.html)\n- post listing paging\n- server side storage optimization\n- [google analytics](/en/google-analytics-in-angular.html)\n- default language changed to Russian","url":"/en/second-iteration-completed.html"},{"title":"Minimalistic Approach For Creating Personal Website","dateCreated":"2017-05-27","id":"minimalistic-approach-for-creating-personal-website","tags":[],"header":"#### Years Go By\nFollowing mainstream practices gets replaced by pragmatism and maintenance costs reduction. New experience forced me to rethink my attitude to this site. Let me outline the major ideas below.","url":"/en/minimalistic-approach-for-creating-personal-website.html"}]