[{"title":"Раскрашиваем ветку Git в терминале","dateCreated":"2014-01-24","id":"color-git-branch-name-in-bash-prompt","tags":["Bash","Cygwin","Git"],"header":"#### Желаемый эффект\nЕсли вы часто пользуетесь git, то иметь название текущей ветки в своей командной строке, а так же подсвечивать \"грязные\" ветки - звучит как хорошая идея.\n\n#### Начало пути\nЯ начал \"допиливать\" командную строку после прочтения [этой статьи](http://mediadoneright.com/content/ultimate-git-ps1-bash-prompt); в ней показано много интересных вещей, однако для меня это оказалось слишком. Я хотел что-то более простое с меньшим количеством информации в командной строке. В итоге получилось вот что:","url":"/color-git-branch-name-in-bash-prompt.html"},{"title":"Создание виджета прогноза погоды с использованием Node.js и Redis","dateCreated":"2014-01-31","id":"weather-forecast-widget","tags":["Cairo","Express","Mustache","Node","Canvas","Redis","Weather Widget"],"header":"#### Что будем строить\nВ этом посте я опишу процесс создания виджета с прогнозом погоды. Я буду использовать Redis для хранения данных и связку Node.js + Express с движком Mustache для web. Модуль \"node canvas\", основанный на Cairo, будет полезен для генерации изображений на сервере.","url":"/weather-forecast-widget.html"},{"title":"Делаем IE Browser Helper Objects включенными по умолчанию","dateCreated":"2014-04-22","id":"making-ie-bho-enabled-by-default","tags":["BHO","c++","Internet Explorer"],"header":"#### Проблема \nДопустим, вы пишете классный BHO. Из соображений безопасности каждый раз, когда пользователь устанавливает BHO и запускает IE он должен подтвердить установку, нажав на кнопку в диалоговом окне. На первый взгляд - ничего особенного, один дополнительный клик никого сильно не напряжет. Однако, такое поведение IE добавляет головной боли разработчику. <code>IObjectWithSite::SetSite</code> метод не вызывается даже после утвердительного ответа пользователя. События <code>DWebBrowserEvents2</code> так же не срабатывают. Таким образом, становится затруднительно отловить момент, в который BHO пора приниматься за дело. [Здесь](http://social.msdn.microsoft.com/Forums/ie/en-US/c6f64c9e-5a34-4d6f-a20e-7bc4fc8c6bac/enable-event-for-bho-in-ie9?forum=ieextensiondevelopment) вопрос описан более детально.","url":"/making-ie-bho-enabled-by-default.html"},{"title":"Selenium запрещает открывать ссылки в новой вкладке вместо нового окна в Firefox","dateCreated":"2014-07-18","id":"selenium-forbids-opening-links-in-new-tab","tags":["Selenium","Firefox","Tab"],"header":"#### Протестировать открытие новой вкладки? Не так быстро\nНедавно я тестировал приложение при помощи Selenium WebDriver и заметил, что Firefox всегда открывает ссылки с атрибутом <code>target=\"_blank\"</code> в новом окне. Я нашел способ изменить это поведение слегка поправив профиль FF:","url":"/selenium-forbids-opening-links-in-new-tab.html"},{"title":"Избирательно gzip-им сайт","dateCreated":"2014-06-02","id":"selectively-gzipping-your-site","tags":["Express","Gzip","Node"],"header":"#### Зачем\nЯ решил построить себе веб сайт. Ключевая идея - писать максимально просто, обеспечить максимальную производительность, ну и не забыть про современные техники такие как SPA и MVVM. Я выбрал связку Node + Angular + MongoDB за основу и принялся за дело. Вскоре я осознал, что мне необходимо сжимать данные при передаче, чтобы не нарушить своих амбициозных требований к производительности.","url":"/selectively-gzipping-your-site.html"},{"title":"Оптимизация web сайта","dateCreated":"2014-07-26","id":"optimizing-the-site","tags":["optimization","node","gruntjs","performance"],"header":"#### Зачем этим заниматься?\nНедавно я закончил первую итерацию построения собственного сайта, а значит, пришло время подумать над web оптимизацией. Что если не заморачиваться и оставить все как есть? Посмотрим на результаты теста [gtmetrix](http://gtmetrix.com/): ","url":"/optimizing-the-site.html"},{"title":"Наконец я зарелизил свой сайт!","dateCreated":"2014-07-28","id":"the-site-has-finally-gone-live","tags":[],"header":"#### Наконец-то\nБезмерно рад сообщить о первом релизе своего сайта! Хотя он пока не богат на функционал, это очень важная веха в моем развитии как разработчика.","url":"/the-site-has-finally-gone-live.html"},{"title":"Локализация дат в Angular","dateCreated":"2014-08-11","id":"dates-localization-in-angular","tags":["Angular","date","localization"],"header":"#### Почему бы не использовать встроенные в Angular возможности?\nДавайте посмотрим, как в angular [можно локализовать контент](https://docs.angularjs.org/guide/i18n). Они предлагают задавать язык путем добавления на страницу соответствующую версию скрипта с локализацией. Можно немного поизвращаться, добавив логику для рендеринга нужного скриптового блока на сервере, но действительно ли мне нужно перезагружать страницу каждый раз при смене языка?","url":"/dates-localization-in-angular.html"},{"title":"Google Analytics в Angular","dateCreated":"2014-08-12","id":"google-analytics-in-angular","tags":["Google Analytics","Angular"],"header":"#### Важно правильно начать\nДобавление google analytics на сайт - довольно прямолинейная операция. В Интернете тонны материала на эту тему. Здесь я опишу возможный способ добавления google analytics в одностраничное приложение (SPA), основанное на Angular, с дальнейшим подсчетом просмотров. Подход может быть легко расширен для сбора других метрик, хотя я полагаю, что подсчет количества просмотров - уже довольно неплохо для начала.","url":"/google-analytics-in-angular.html"},{"title":"Вторая итерация завершена","dateCreated":"2014-08-13","id":"second-iteration-completed","tags":[],"header":"#### Что добавлено \nЯ только что закончил вторую итерацию по разработке своего сайта.\n- [локализиция дат](/dates-localization-in-angular.html);\n- пейджинг списка заметок;\n- оптимизация хранилища на стороне сервера;\n- [google analytics](/google-analytics-in-angular.html);\n- язык по умолчанию теперь русский.","url":"/second-iteration-completed.html"},{"title":"Минималистичный подход к созданию личного сайта","dateCreated":"2017-05-27","id":"minimalistic-approach-for-creating-personal-website","tags":[],"header":"#### Годы идут\nМодные практики уступают место прагматизму и минимизации затрат на поддержку. Новый опыт заставил меня пересмотреть свое отношение к этому сайту. Основные идеи я решил изложить ниже.","url":"/minimalistic-approach-for-creating-personal-website.html"}]